{$APPTYPE CONSOLE}

var
  x, eps, p, y: real;
  k, i, j, f, elem: integer;

begin
  { Инициализация переменных }
  x:=-0.3;

  { Вывод заголовка таблицы }
  writeln('|-----|-------|------------|-------------|--------------|');
  writeln('|  i  |   x   |  0.0001    |  0.00001    |  0.000001    |');
  writeln('|-----|-------|------------|-------------|--------------|');

  i:=1;
  repeat
    { Вывод номера строки и текущего x в таблицу }
    write('|', i:3, '  |', x:6:2, ' |');

    { Инициализация переменных, которые должны получать }
    { Значения по умолчанию после каждого изменения x }
    eps:=0.0001;
    p:=x*x*x;
    k:=1;
    f:=1;
    y:=-p/f;
    elem:=1;

    { Цикл изменяющий значение eps }
    j:=4;
    repeat
      repeat
        p:=-p*x;               //Вычисление степени
        k:=k+1;
        f:=f*(2*k-2)*(2*k-1); //Вычисление факториала
        y:=y-p/f;
				inc(elem);
      until abs(p/f)<=eps;
      write(y:j+5:j+1, ' ', elem, ' |'); //Вывод ячейки таблицы
      eps:=eps/10;            //Изменяем точность
      inc(j);
    until j>6;
    writeln;
    x:=x+0.05;
    inc(i);
  until i>20;
  readln;
end.
